{
  "event_title": "Act I - Old Beginnings",
  "story_name": "A1E1",

  "story_nodes": {
    "entry": {
      "story_text": "You wake up on your ship. You see a few stumbling next to you, heaving the contents of their stomachs. The first thing to hit your senses is the stark coldness and the dimmness of the room.\n You glance around to see many other of your crew are 'asleep', acryogenically frozen next to you. You, as captain, deduct that there must be a ship wide catastrophe to have so many teleported to this one room. You don't find the room to be the bridge, either, indicating the containment shielding must have failed there as well.\n It's easy to tell that something bad happened, and you need to take the lead in fixing whatever went down. As an unfortunate side effect of the cryogenic sleep, you've forgotten recent memories, ranging all the way back to what you think is the time you left the shipyards, supposedly on this mission. Who knows how long you've been out.",
      "results": false,
      "choice_nodes": ["C1", "C2"]
    },

    "S1": {
      "story_text": "You start talking with the others, slowly and surely making your way around to everyone nearby. Upon further conversation, you realize everyone else is in a similar predicament to you, and they remember almost as much as you, a few remembering a key bit more than you, but nothing important.\n Despite this, the conversations lead to what to do next, and shortly the hum of a localized power plant kicks in, booting up the majority of the disabled computers and lights.",
      "results": [
        {
          "effect": "set_engineering +10",
          "result_text": "Power supply reinitialized (+10 Engineering Strength)",
          "result_type": "#00b359",
          "conditions": false
        },
        {
          "effect": "set_engineering +10",
          "result_text": "Sensor Systems reinitialized (+10 Engineering Strength)",
          "result_type": "#00b359",
          "conditions": false
        }
      ],
      "choice_nodes": ["C2"]
    },

    "S2": {
      "story_text": "You move to a ship wide scanner, after fiddling with the backup power through a terminal, the near black screen beeps into life.\n Punching in the commands you need, you quickly get the scanner working, and you identify three distinct holds, much like your own, around the ship. After some quick coordination with the rest of the crew, you all decide the best course of action is getting in contact with these people.",
      "results": [
        {
          "effect": "trigger_event A2",
          "result_text": "You find out the location of the crew, and work to meet with them.",
          "result_type": "#0059b3"
        },
        {
          "effect": "set_engineering +10",
          "result_text": "Power supply reinitialized (+10 Engineering Strength)",
          "result_type": "#00b359",
          "conditions": ["NOT_STORY_NODE S1"]
        },
        {
          "effect": "set_engineering +10",
          "result_text": "Sensor Systems reinitialized (+10 Engineering Strength)",
          "result_type": "#00b359",
          "conditions": ["NOT_STORY_NODE S1"]
        }
      ],
      "choice_nodes": false
    }
  },

  "choice_nodes": {
    "C1": {
      "choice_title": "Choice I: Organize with the crew",
      "choice_text": "You start talking with the others, slowly and surely making your way around to everyone nearby ... ",
      "choice_color": "#003264"
    },

    "C2": {
      "choice_title": "Choice II: Scout for other survivors",
      "choice_text": "You move to a ship wide scanner ... ",
      "choice_color": "#003264"
    }
  }
}